export const tabs = [
  { id: "muktak", label: "मुक्तक" },
  { id: "kavita", label: "कविता" },
  // { id: "geet", label: "गीत" },
  { id: "ghazal", label: "ग़ज़ल" },
  // { id: "nazm", label: "नज़्म" },
  { id: "shayari", label: "शायरी" },
];

export const tabContent: {
  [key: string]: { title: string; description: string[] }[];
} = {
  muktak: [
    {
      title: "आपका  उपनाम  होने के लिए|",
      description: [
        "उस हृदय का धाम होने के लिए।",
        "इक सिया का राम होने के लिए।",
        "है किये कितने जतन मेने सुनो।",
        "आपका  उपनाम  होने के लिए ।",
      ],
    },
    {
      title: "फिर  कविता  में  पिरोया  जाएगा। ",
      description: [
        "पुनः नयनों को  भिगोया जाएगा ।",
        "पूर्णकालिक  दुख संजोया जाएगा।",
        "अश्रुमोती  को   पतन  से रोक कर।",
        "फिर  कविता  में  पिरोया  जाएगा। ",
      ],
    },
    {
      title: "जो  मेंरे  खातिर  ताज  बनाने  वाले थे।",
      description: [
        "वो जो कल  को आज बनाने  वाले थे।",
        "जो धड़कन  को साज़  बनाने वाले थे ।",
        "मुसीबतों  का दौर  देख  कर  चले गए।",
        "जो  मेंरे  खातिर  ताज  बनाने  वाले थे।",
      ],
    },
    {
      title: "रूखमणी  साथ  पूजी  नही  जा  सकी।",
      description: [
        "वो क्या  पीड़ा जो पीड़ा सही जा सकी।",
        "वो व्यथा क्या व्यथा जो कही जा सकी।",
        "कृष्ण  के   संग   पूजी   गई  राधिका ।",
        "रूखमणी  साथ  पूजी  नही  जा  सकी।",
      ],
    },
    {
      title: "अगर हर देश वासी का हृदय श्री राम हो जाये।",
      description: [
        "बनारस सा सवेरा और अवध सी शाम हो जाये।",
        "सरिता  धर्म की  बहती  रहे  अविराम  हो जाये।",
        "यहाँ फिर हर गली बैकुंठ हर पद धाम हो जाये।",
        "अगर हर देश वासी का हृदय श्री राम हो जाये।",
      ],
    },
    {
      title: "मेरे इजहार  से पहले  ही तुम इजहार कर दो ना।।",
      description: [
        "दिलों को  जोड़ कर  दोनों के एकाकार कर दो ना।",
        "पड़े बंजर मेरे इस दिल को तुम गुलजार कर दो ना।",
        "ये मेरा मोम सा  दिल है कहि बन जाए ना पत्थर।",
        "मेरे इजहार  से पहले  ही तुम इजहार कर दो ना।।",
      ],
    },
    {
      title: "हर  मंदिर  में  मन्नत  के  धागे  तुमको  मिल जाएंगे",
      description: [
        "चंद पलों का  साथ मगर  जीवन भर  प्रेम निभाएंगे।",
        "महफ़िल महफ़िल नाम तुम्हारा गीत गजल में गाएंगे।",
        "तुमको पाने खातिर मैने जतन किये कितने सुन लो।",
        "हर  मंदिर  में  मन्नत  के  धागे  तुमको  मिल जाएंगे",
      ],
    },
    {
      title: "जिंदगी  के  चार  भी  बाकी  नही।",
      description: [
        "दीद  के  आसार भी  बाकी  नही।",
        "दरमियाँ अब प्यार भी बाकी नही।",
        "उसकी शादी में  बचे है  तीन दिन।",
        "जिंदगी  के  चार  भी  बाकी  नही।",
      ],
    },
    {
      title: "टोकरी   में   सवार   आया  है।",
      description: [
        "जग के प्रश्नों  का सार आया है।",
        "प्यारी  राधा का  प्यार आया है।",
        "सारे  संसार  का  स्वामी देखो ।",
        "टोकरी   में   सवार   आया  है।",
      ],
    },
    {
      title: "ये वही  आवाज  है पहचान  लो।",
      description: [
        "इक  पुराना  राज  है पहचान लो।",
        "हाँ, हाँ वही अंदाज है पहचान लो।",
        "जिसके दीवाने हुए थे तुम कभी।",
        "ये वही  आवाज  है पहचान  लो।",
      ],
    },
    {
      title: "पूर्णिमा की रात गंगा घाट पर।",
      description: [
        "हाथ मे था हाथ गंगा घाट पर।",
        "और घंटो बात  गंगा  घाट पर।",
        "खो गया था याद है पाजेब भी।",
        "पूर्णिमा की रात गंगा घाट पर।",
      ],
    },
    {
      title: "पर्स  में  रख्खी  हुई  तस्वीर  को।",
      description: [
        "तीन सालों  से  सुलगती पीर को।",
        "एकलौती  प्यार  की जागीर को।",
        "अब भी ना आये यकीं तो देख लो।",
        "पर्स  में  रख्खी  हुई  तस्वीर  को।",
      ],
    },
    {
      title: "अब  बराबर  बात  है  मेरे  लिए।",
      description: [
        "एक  ही   हालात  है  मेरे  लिए।",
        "दिन भी  काली रात है मेरे लिए।",
        "तेरा होना  और ना होना सनम।",
        "अब  बराबर  बात  है  मेरे  लिए।",
      ],
    },
    {
      title: "चार धामों  से  कुछ नही होगा।",
      description: [
        "इन मुकामों से कुछ नही होगा।",
        "नैक कामों से कुछ नही होगा।",
        "जीते जी जो ना माँ को पूजोगे।",
        "चार धामों  से  कुछ नही होगा।",
      ],
    },
    {
      title: "मित्र  हर  बार  बन  के  तू आए।",
      description: [
        "प्रेम का  सार  बन  के तू आए ।",
        "हर्ष का  द्वार  बन  के  तू आए।",
        "जब भी में जन्म इस धरा पर लूँ।",
        "मित्र  हर  बार  बन  के  तू आए।",
      ],
    },
  ],
  kavita: [
    {
      title: "ये गोपाल भी उस परम् कृपालु महाकाल का बेटा है।",
      description: [
        "जिनके चरणों मे शिप्रा मैया पाप जगत के धोती है।",
        "जिसकी पूजा भी नश्वर देह के भस्म लेप से होती है।",
        "शिप्रा के तट बैठे साधु भी जिनकी महिमा गाते है।",
        "बड़े  बड़े  राजा भी जिनके  आगे  शीश झुकाते है।",
        "काल भैरव की कृपा जहाँ है, हरसिद्धि की माया है।",
        "अपने हर भक्तों के ऊपर जिस विश्व पिता की छाया है।",
        "रुद्राक्ष  गले मे  डाल जो  वहाँ  मुक्तिधाम  में लेटा है।",
        "ये गोपाल भी उस परम् कृपालु महाकाल का बेटा है।",
      ],
    },
    {
      title: "अभिलाषा ले मोक्ष की  , जप  राम राम मर जाउंगी|",
      description: [
        "प्रभु दरस की प्यासी सीता तड़प रही इस उपवन में।",
        "ओर नही कुछ दिखता है,बस छवि राम की नैनन में।",
        "हर पल , हर क्षण तो मानो  कांटो सा चुभता  है मुझको।",
        "ये फलाहार भी अब तो विष के जैसा दिखता है मुझको।",
        "बहुत समय है बीत गया,आखिर कब  तक तड़पाओगे।",
        "इस दुष्ट , अनाचारी का वध  कर  लेने मुझको आओगे।",
        "नही हुई गर भोर मिलन की , बस इतना कर जाऊंगी।",
        "अभिलाषा ले मोक्ष की  , जप  राम राम मर जाउंगी|",
      ],
    },
    {
      title: "याद रखना ये धरा यूं ही नही आजाद है।",
      description: [
        "याद करो जय जय जय जय मेवाड़ भरी हुंकारों को।",
        "याद करो वो रणभूमि की रणचंडी तलवारों को।",

        "आओ मिल के याद करें उस युग की नारी शक्ति को।",
        "आओ मिल कर याद करे चेतक की स्वामी भक्ति को।",

        "बहलोल खान के दो टुकड़े , वो रक्तिम माटी याद करो।",
        "सन 57 का भीषण रण वो हल्दी घाटी याद करो।",

        "चार बांस चौबीस गज और अंगुल अष्ट प्रमाण।",
        "आओ मिल कर याद करें वो शब्द भेदते बाण ।",

        "याद कर लो जो निडर हो काल के सम्मुख खड़ी थी।",
        "बांध शिशु को पीठ पर बन के भवानी जो लड़ी थी।",

        "मातृभूमि की रज मस्तक पर मल कर वचन निभाया था।",
        "सात समंदर पार पहुंच डायर को मारा गिराया था।",

        "लाल रक्त से खेली थी बेटों ने  होली याद करो।",
        "शेखर की पिस्टल से निकली अंतिम गोली याद करो l",

        "भारत माता के हित में जो निजसुख अपना भूल गया ।",
        "भगवत गीता हाथ लिए हंसकर फंदे पर झूल गया ।",

        "याद करो तैवीस वर्ष की भरी जवानी याद करो",
        "चट्टानों से वक्ष और तेवर तूफानी याद करो।",

        "याद करो तब अंग्रेजों को नानी याद दिलाई थी।",
        "जिन वीरों के बलिदानों से हमने आजादी पाई थी।",

        "यूं ही नही स्वाधीनता के गुल सुगंधित हो गए थे।",
        "कितने ही बेटे आहुति के सम समर्पित हो गए थे।",

        "उन्मुक्त नभ में लहलहाता ये तिरंगा गा रहा ।",
        "यूंही नही आजाद है हर एक को समझा रहा।",

        "तो बेड़ियों का त्रास सहते कंठ का उन्माद है ।",
        "याद रखना ये धरा यूं ही नही आजाद है।",
      ],
    },
    {
      title: "एक  वोट  ने ही  पूरे  भारत  को  भगवा  कर डाला।",
      description: [
        "एक वोट की ताकत ने ही राम लला को धाम दिया।",
        "एक वोट की ताकत ने भारत को नव आयाम दिया।",

        "एक वोट की ताकत ही घाटी का कालिक धोती है।",
        "स्वयं सोचिए  एक वोट  में कितनी ताकत होती है।",

        "एक वोट पर निर्भर है , क्या खो दोगे क्या पाओगे।",
        "एक वोट पर निर्भर है , क्या पांच साल में खाओगे।",
        "एक वोट  की चोट पड़ी  तब ही  आतंकी भागे है।",
        "एक वोट  के कारण ही  भारत दुनिया मे  आगे है।",

        "एक वोट  ने ही  जयचन्दों  के चंदो  को  बंद किया।",
        "एक वोट ने ही जे एन यू की ध्वनियों को मंद किया।",

        "एक वोट ही संकट है जनता का और निवारण है।",
        "एक वोट बस्तीवासी के सर पर छत का कारण है।",

        "एक वोट ने मूक कर दिया बक बक करती मैना को।",
        "एक वोट ने हाथ  खोल कर  दी आज़ादी  सेना को।",

        "वर्षों से सोए पौरुष को भी स्वाभिमान से भर डाला।",
        "एक  वोट  ने ही  पूरे  भारत  को  भगवा  कर डाला।",
      ],
    },
    {
      title: "ये आज़ादी नील गगन में उड़ता हुआ तिरंगा है।",
      description: [
        "ये आज़ादी बोस भगत बिस्मिल शेखर की गोली है ।",
        "ये  आज़ादी  भारत  माँ के  आंगन  रची  रंगोली  है।",

        "ये  आजादी सत्तावन के मतवालों की थाती है।",
        "ये आज़ादी उन  वीरों के बलिदानों को गाती है।",
        
        "ये आज़ादी जन गण मन है वंदे मातरम गान है।",
        "ये आज़ादी खेतों में भयमुक्त लहरता धान है।",

        "ये आज़ादी सतपुड़ा से धनुषकोटि तक व्यापक है।",
        "ये आज़ादी दिव्य सनातन राष्ट्र धर्म संस्थापक है।",

        "महज बीस की आयु में श्रम के सपने बुन लेती है।",
        "ये आज़ादी प्रेम छोड़ कर पिस्टल को चुन लेती है।",

        "ये आज़ादी तुंग हिमालय कल कल करती गंगा है।",
        "ये आज़ादी नील गगन में उड़ता हुआ तिरंगा है।",
      ],
    },
  ],
  // geet: [
  //   {
  //     title: "यह गीत का कंटेंट है।",
  //     description: ["आपका  उपनाम  होने के लिए|"],
  //   },
  //   {
  //     title: "मित्र  हर  बार  बन  के  तू आए।",
  //     description: ["आपका  उपनाम  होने के लिए|"],
  //   },
  // ],
  ghazal: [
    {
      title: "ना आंखों ने इशारा किया , जुबां से कुछ ना हुआ।",
      description: [
        "दवा भी काम ना आई ,  दुआ से कुछ ना हुआ।",
        "चराग-ए-इश्क़ बुझाना था , हवा से कुछ ना हुआ।",
        "मुकदमा-ए-इश्क़ था मुझपे , इंसाफ खुदा के हाथ।",
        "ना दलीलें काम  आई , गवाह से कुछ ना हुआ।",
        "कठपुतलियां थे हम डोर खुदा के हाथ थी।",
        "खुदा  की बात थी , खुदा से कुछ ना हुआ।",
        "बस दिल ही बहलाना था मुझको , शर्त थी तेरे बगैर।",
        "मौसमो ने कोशिश की , फ़िज़ा से कुछ ना हुआ।",
        "हाँ हो सकता था कुछ , अगर इजहार हो जाता।",
        "ना आंखों ने इशारा किया , जुबां से कुछ ना हुआ।",
      ],
    },
    {
      title: "मेने देखा  है इश्क़  के खेल में  सियासत  होती है।",
      description: [
        "इश्क़  के  जहाँ  में  कहाँ  कोई सरहद  होती  है।",
        "मोहब्बत  जब  किसी  से होती है , बेहद होती है।",
        "किसी  को  पाना  इतना  आसां  नही होता यारो।",
        "उसे  अपना  बनाने  में  बड़ी  जद्दोजहद होती है।",
        "कई दफा मुझसे   इश्क़ की तासीर पूछते है लोग।",
        "बस इतना मान लीजिए कि कड़वा शहद होती है।",
        "जितनी   वफ़ा   चाहो   उतनी   नाराजगी   उनसे।",
        "शायद वो भूल जाते है बर्दाश्त की भी हद होती है।",
        "काश मेरे  हिस्से में  भी उतना वक्त निकालती वो।",
        "जितनी   औरो   के   लिए  बखुशामद   होती  है।",
        "ये बचपन  के खेल  नही की  जितना  आसान हो।",
        "मेने देखा  है इश्क़  के खेल में  सियासत  होती है।",
      ],
    },
    {
      title: "कभी ना कभी मेंरे भी दर  मेहमान आएगा।",
      description: [
        "डूबता आफताब  भी मुठ्ठी में  लेकर  शाम आएगा।",
        "चराग़ जुल्मत-ए-शब में जलेगा तो काम आएगा।",
        "अभी  महफ़िल  में  कोई  खास  रोनक ही  नही है।",
        "लगता है उसी के आने से दिल को आराम आएगा।",
        "मसाफ़िर-ए-दुनिया हर कोई  है , तुम्ही थोड़ी हो ।",
        "इस कश्ती से वही उतरेगा जिसका मुकाम आएगा।",
        "गुलशन-ए-हस्ती  में हर तरह  के फूल है गोपाल।",
        "तू खास थोड़ी है जो तेरे करीब बागबान आएगा।",
        "इस यकीन से अपने दरवाजे खुले रखता हूँ।",
        "कभी ना कभी मेंरे भी दर  मेहमान आएगा।",
      ],
    },
    {
      title: "अपनी ही दो चार सुनाता है ,चला जाता है।",
      description: [
        "बस मुझे दूर से चिढ़ाता है, चला जाता है।",
        "इश्क़ दरवाजे तक आता है ,चला जाता है ।",
        "वो  दौर  गया   की   जब   हम  मिला  करते  थे।",
        "अब बस ख्वाबों में सताता है ,चला जाता है।",
        "तुम  फिक्र  मत करो  तुम्हे  और  अच्छा मिलेगा।",
        "हर शख्स  यही दोहराता है ,चला  जाता है।",
        "वो कुछ  ही  है  जिन्हें रोक  लेता है प्यार मेरा।",
        "जाने वाला  तो बस  जाता है ,चला जाता है।",
        "है   ख्वाब   की   वो   आये   मिरा   हाल   पूछे ।",
        "अपनी ही दो चार सुनाता है ,चला जाता है।",
      ],
    },
    {
      title: "मुझे खोने से भी डरती थी मियां।",
      description: [
        "हां एक लड़की थी मियां।",
        "मगर वो है  नही  थी मियां।",
        "वो मेरी जिंदगी में थी नही लेकिन।",
        "वो ही मेरी जिंदगी थी मियां।",
        "मजाल है कोई टोक दे गर।",
        "इस क़दर बोलती थी मियां।",
        "सुबह मुठ्ठी में लाती मेरे खातिर।",
        "सोये तो शाम ढलती थी मियां।",
        "बादल आशिक़ हो पहरा देते थे।",
        "वो जब धूप में निकलती थी मियां।",
        "ये मत पूछो की मेने क्या देखा।",
        "उसके माथे पे एक बिंदी थी मियां।",
        "मुझसे नाराज़ बहुत होती थी लेकिन।",
        "मुझे खोने से भी डरती थी मियां।",
      ],
    },
  ],
  // nazm: [
  //   {
  //     title: "यह नज़्म का कंटेंट है।",
  //     description: ["आपका  उपनाम  होने के लिए|"],
  //   },
  //   {
  //     title: "मित्र  हर  बार  बन  के  तू आए।",
  //     description: ["आपका  उपनाम  होने के लिए|"],
  //   },
  // ],
  shayari: [
    {
      title: "अभी फेरे तुम्हारे देखना है।",
      description: [
        "कहो क्या क्या नज़ारे देखना है।",
        "कितने टूटे सितारे देखना है।",
        "थामे दिल सगाई देख ली है।",
        "अभी फेरे तुम्हारे देखना है।",
      ],
    },
    {
      title: "वो शख्स भी मेरे प्यार का प्यासा  हो जाये।",
      description: [
        "ए खुदा कुछ कर कमाल की ऐसा हो जाये ।",
        "वो शख्स भी मेरे प्यार का प्यासा  हो जाये।",
      ],
    },
    {
      title: "क्या किस्मत पाई है तेरे घर के आईने ने।",
      description: [
        "वो  तुझे  आंख  भर  के  देख  लेता  है।",
        "क्या किस्मत पाई है तेरे घर के आईने ने।",
      ],
    },
    {
      title: "की तू दौड़ कर आये और लिपट जाए तो अच्छा है।",
      description: [
        "ये दूरियां जो भी है, अब मिट जाए तो अच्छा है।",
        "ये लम्हे है जो भी है, अब सिमट जाए तो अच्छा है।",
        "ओर  तन्हाइयां  खाने  लगी  है इस  क़दर  मुंझे ।",
        "की तू दौड़ कर आये और लिपट जाए तो अच्छा है।",
      ],
    },
    {
      title: "वही जो राह में तन्हा खड़ा है।",
      description: [
        "बहुत आसान है आना यहां पर।",
        "यहां से लौटना मुश्किल बड़ा है।",
        "उसी ने राह में कलियाँ बिछाई ।",
        "वही जो राह में तन्हा खड़ा है।",
      ],
    },
    {
      title: "जो मेहबूब के खयालों में जी लेते है।",
      description: [
        "बेघर , बेबस ,फटे हालों में जी लेते है।",
        "जीने वाले सूखे निवालों में जी लेते है।",
        "दीदार की दरकारी नही हम तो वो है।",
        "जो मेहबूब के खयालों में जी लेते है।",
      ],
    },
    {
      title: "एक हंसता चेहरा कितने  गम लिए बैठा है।",
      description: [
        "ख्वाहिशों की मौत का मातम लिए बैठा है।",
        "एक हंसता चेहरा कितने  गम लिए बैठा है।",
      ],
    },
    {
      title: "इसी चेहरे की रंगत था कभी वो।",
      description: [
        "बुरे लम्हों में राहत था कभी वो।",
        "मेरे हर दर की मन्नत था कभी वो।",
        "ये जो  चेहरे की रंगत खो गई है।",
        "इसी चेहरे की रंगत था कभी वो।",
      ],
    },
    {
      title: "मौत का एहसास था जीते हुए।",
      description: [
        "जब  दिन याद आये  बीते हुए।",
        "जिंदगी पी गए शराब पीते हुए।",
        "दौर-ए-हिज़्र का हाल मत पूछो।",
        "मौत का एहसास था जीते हुए।",
      ],
    },
    {
      title: "तेरे साथ बिताए लम्हों की खुशबू आती है।",
      description: [
        "अक्सर  दिल में  दीद की  आरजू आती है।",
        "पर ना तेरी खबर आती है , ना तू आती है।",
        "जब कभी इन गलियों से गुजरना होता है।",
        "तेरे साथ बिताए लम्हों की खुशबू आती है।",
      ],
    },
    {
      title: "मित्र  हर  बार  बन  के  तू आए।",
      description: [
        "इश्क़ भी उसी से , चाहत भी वही।",
        "कमजोरी   ओर  हिम्मत  भी वही।",
        "लोग मन्नत बदल देते हैं , दर बदल देते है।",
        "मेरा दर भी वही है , मन्नत भी वही।",
      ],
    },
    {
      title: "एक हाथ था जो मेरे हाथ मे हुआ करता था।",
      description: [
        "गम-ए-माहौल जब हयात में हुआ करता था।",
        "एक हाथ था जो मेरे हाथ मे हुआ करता था।",
      ],
    },
    {
      title: "मेरे दिल में आरक्षण पाए हुए है।",
      description: [
        "आपको दो चार बताए हुए है।",
        "दिल मे ओर भी छुपाए हुए है।",
        "जनरल कास्ट वाली वो लड़की।",
        "मेरे दिल में आरक्षण पाए हुए है।",
      ],
    },
  ],
};
